In [62]:
import pandas as pd
import numpy as np
import math
from sqlalchemy import create_engine

### Oracle에 접속하기

In [63]:
engine = create_engine('oracle+cx_oracle://TEST1:test1@10.184.9.64:1521/xe') 
#engine = create_engine('oracle+cx_oracle://TEST1:TEST1@127.0.0.1:1521/xe') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_channel_seasonality_new', engine)

### CSV로 data불러오기

In [4]:
#selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [64]:
selloutData.head(2)

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0

In [65]:
len(selloutData)

124658

In [66]:
selloutData.dtypes #데이터 type 확인

regionid     object
product      object
yearweek     object
qty         float64
dtype: object

### 컬럼 대문자로 변경

In [67]:
selloutData.columns = [x. upper() for  x in selloutData.columns]
selloutData.columns

Index(['REGIONID', 'PRODUCT', 'YEARWEEK', 'QTY'], dtype='object')

# 1. Data Cleaning

### 1) 53주차 제거 - 추후 1주~52주차 평균값으로 53주차 대입 및 YEARWEEK TYPE STR 타입으로 변경

In [68]:
selloutData = selloutData.loc[selloutData["YEARWEEK"].astype(str).str[4:6]!="53"]

In [69]:
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0

In [70]:
len(selloutData)

123864

### 2) 데이터내 음수는 0값으로 아니면 기존 QTY 데이터 가지고 와서 QTY_NEW 테이블 생성

In [71]:
selloutData["QTY_NEW"] = np.where(selloutData["QTY"] < 0, 0, selloutData["QTY"])

In [72]:
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW
0      A60   PRODUCT4   201402     71.0     71.0
1      A60  PRODUCT59   201402  22275.0  22275.0

In [73]:
len(selloutData)

123864

### 3) YEAR 하고 WEEK 분리

In [74]:
selloutData["YEAR"] = selloutData["YEARWEEK"].astype(str).str[0:4]
selloutData["WEEK"] = selloutData["YEARWEEK"].astype(str).str[4:6]
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02

In [75]:
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02

### 4) Data 정렬하기(REDIONID , PRODUCT, YEARWEEK)

In [76]:
selloutData.sort_values(["REGIONID","PRODUCT","YEARWEEK"], ascending = [True,False,False])
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02

### 5) Index RESET 작업

In [77]:
selloutData = selloutData.reset_index(drop=True)

In [78]:
selloutData.head(2)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02

# 2. Group 지정

### 1) 평균값 구하기

In [79]:
# data의 경우 지역변수로 생각하면 된다.
def sub_function(data):
    data.reset_index(drop=True, inplace=True)    
    data["MA"] = data["QTY_NEW"].rolling(window = 7, center = True, min_periods=1).mean()
    return data

# sub_function 함수를 호출하여 rolling함수를 적용 / Regionid 와 product를 groupby로 묶어서 gropData 변수에 저장해라
groupData = selloutData.groupby(["REGIONID","PRODUCT"]).apply(sub_function)  

groupData.head(2)

                     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34   201404  532.0    532.0  2014   04
                   1      A00  PRODUCT34   201401  661.0    661.0  2014   01

                         MA
REGIONID PRODUCT
A00      PRODUCT34 0  612.5
                   1  574.6

In [80]:
pwd

'D:\\python working\\Python_CJ_ST\\5. 미니프로젝트-로직'

In [81]:
groupData.to_csv("./groupData_mean.csv")

### 2) 변동률(STD) 구하기

In [82]:
# data의 경우 지역변수로 생각하면 된다.
def sub_function(data):
    data.reset_index(drop=True, inplace=True)    
    data["STD"] = data["MA"].rolling(window = 7, center = True, min_periods=1).std()
    return data

# sub_function 함수를 호출하여 rolling함수를 적용 / Regionid 와 product를 groupby로 묶어서 gropData 변수에 저장해라
stdData = groupData.groupby(["REGIONID","PRODUCT"]).apply(sub_function)  

stdData.head(2)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: 'REGIONID' is both a column name and an index level.
Defaulting to column but this will raise an ambiguity error in a future version

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: 'PRODUCT' is both a column name and an index level.
Defaulting to column but this will raise an ambiguity error in a future version

                     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34   201404  532.0    532.0  2014   04
                   1      A00  PRODUCT34   201401  661.0    661.0  2014   01

                         MA        STD
REGIONID PRODUCT
A00      PRODUCT34 0  612.5  26.264982
                   1  574.6  29.606338

In [24]:
#stdData.to_csv("./stdData.csv")

### 3) 상한선(UPPER) / 하한선(LOWER) 구하기

In [83]:
stdData["UPPER"] = stdData["MA"] + stdData["STD"]
stdData["LOWER"] = stdData["MA"] - stdData["STD"]
stdData.head(5)

                     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34   201404  532.0    532.0  2014   04
                   1      A00  PRODUCT34   201401  661.0    661.0  2014   01
                   2      A00  PRODUCT34   201402  679.0    679.0  2014   02
                   3      A00  PRODUCT34   201403  578.0    578.0  2014   03
                   4      A00  PRODUCT34   201406  423.0    423.0  2014   06

                              MA        STD       UPPER       LOWER
REGIONID PRODUCT
A00      PRODUCT34 0  612.500000  26.264982  638.764982  586.235018
                   1  574.600000  29.606338  604.206338  544.993662
                   2  564.833333  40.893287  605.726620  523.940046
                   3  551.285714  48.944649  600.230364  502.341065
                   4  533.428571  51.644551  585.073123  481.784020

### 4) 정제된 판매량 구하기

In [84]:
stdData["REFINED_QTY"] = np.where(stdData["QTY_NEW"] > stdData["UPPER"], stdData["UPPER"],\
                         np.where(stdData["QTY_NEW"] < stdData["LOWER"], stdData["LOWER"],stdData["QTY_NEW"]))
stdData.head(5)

                     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34   201404  532.0    532.0  2014   04
                   1      A00  PRODUCT34   201401  661.0    661.0  2014   01
                   2      A00  PRODUCT34   201402  679.0    679.0  2014   02
                   3      A00  PRODUCT34   201403  578.0    578.0  2014   03
                   4      A00  PRODUCT34   201406  423.0    423.0  2014   06

                              MA        STD       UPPER       LOWER  \
REGIONID PRODUCT
A00      PRODUCT34 0  612.500000  26.264982  638.764982  586.235018
                   1  574.600000  29.606338  604.206338  544.993662
                   2  564.833333  40.893287  605.726620  523.940046
                   3  551.285714  48.944649  600.230364  502.341065
                   4  533.428571  51.644551  585.073123  481.784020

                      REFINED_QTY
REGIONID PRODUCT
A00      PRODUCT34 0   586.235018
                   1   604.206338
                   2   605.726620
                   3   578.000000
                   4   481.784020

### 5)스무딩 처리(SMOOTH) - 추세선

In [85]:
# data의 경우 지역변수로 생각하면 된다.
def sub_function(data):
    data.reset_index(drop=True, inplace=True)    
    data["SMOOTH"] = data["REFINED_QTY"].rolling(window = 7, center = True, min_periods=1).mean()
    return data

# sub_function 함수를 호출하여 rolling함수를 적용 / Regionid 와 product를 groupby로 묶어서 gropData 변수에 저장해라
stdData = stdData.groupby(["REGIONID","PRODUCT"]).apply(sub_function)  

stdData.head(2)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: 'REGIONID' is both a column name and an index level.
Defaulting to column but this will raise an ambiguity error in a future version

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: 'PRODUCT' is both a column name and an index level.
Defaulting to column but this will raise an ambiguity error in a future version

                     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34   201404  532.0    532.0  2014   04
                   1      A00  PRODUCT34   201401  661.0    661.0  2014   01

                         MA        STD       UPPER       LOWER  REFINED_QTY  \
REGIONID PRODUCT
A00      PRODUCT34 0  612.5  26.264982  638.764982  586.235018   586.235018
                   1  574.6  29.606338  604.206338  544.993662   604.206338

                          SMOOTH
REGIONID PRODUCT
A00      PRODUCT34 0  593.541994
                   1  571.190399

### 6) 안정 지수 / 불안정 지수

In [89]:
stdData["SEASON_1"] = stdData["QTY_NEW"] / stdData["SMOOTH"]
stdData["SEASON_2"] = stdData["REFINED_QTY"] / stdData["SMOOTH"]
stdData.head(5)

                     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK  \
REGIONID PRODUCT
A00      PRODUCT34 0      A00  PRODUCT34   201404  532.0    532.0  2014   04
                   1      A00  PRODUCT34   201401  661.0    661.0  2014   01
                   2      A00  PRODUCT34   201402  679.0    679.0  2014   02
                   3      A00  PRODUCT34   201403  578.0    578.0  2014   03
                   4      A00  PRODUCT34   201406  423.0    423.0  2014   06

                              MA        STD       UPPER       LOWER  \
REGIONID PRODUCT
A00      PRODUCT34 0  612.500000  26.264982  638.764982  586.235018
                   1  574.600000  29.606338  604.206338  544.993662
                   2  564.833333  40.893287  605.726620  523.940046
                   3  551.285714  48.944649  600.230364  502.341065
                   4  533.428571  51.644551  585.073123  481.784020

                      REFINED_QTY      SMOOTH  SEASON_1  SEASON_2
REGIONID PRODUCT
A00      PRODUCT34 0   586.235018  593.541994  0.896314  0.987689
                   1   604.206338  571.190399  1.157232  1.057802
                   2   605.726620  561.991999  1.208202  1.077821
                   3   578.000000  548.850285  1.053111  1.053111
                   4   481.784020  523.245283  0.808416  0.920761

In [88]:
# if stdData["SEASON_1"] == null:
#     stdData["SEASON_1"] = 0
# else:
#     stdData["SEASON_1"] = stdData["SEASON_1"]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\ops.py:816: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = getattr(x, name)(y)

TypeError: invalid type comparison

In [29]:
stdData.to_csv("./stdData_result.csv")

In [54]:
len(stdData)

123864

### oracle의 경우 table 및 컬럼 값 모두 대문자로 해야 한다.

### postgres 접속 방법 및 업로드(컬럼 및 table의 경우 모두 소문자로 작성)

In [44]:
# DB 커넥션 열기
engine1 = create_engine('postgresql://postgres:test1@10.184.9.64:5432/postgres')

### 컬럼 소문자로 변경하기

In [50]:
stdData.columns = [x.lower() for  x in stdData.columns]
stdData.columns

Index(['regionid', 'product', 'yearweek', 'qty', 'qty_new', 'year', 'week',
       'ma', 'std', 'upper', 'lower', 'refined_qty', 'smooth', 'season_1',
       'season_2'],
      dtype='object')

In [52]:
stdData.to_sql("kopo_channel_seasonality_result6", engine1, if_exists='replace', index=False)

In [53]:
sqlData = pd.read_sql_query('SELECT * FROM kopo_channel_seasonality_result6', engine1)
sqlData.head(5)

,regionid,product,yearweek,qty,qty_new,year,week,ma,std,upper,lower,refined_qty,smooth,season_1,season_2
0,A00,PRODUCT34,201404,532.0,532.0,2014,04,612.500000,26.264982,638.764982,586.235018,586.235018,593.541994,0.896314,0.987689
1,A00,PRODUCT34,201401,661.0,661.0,2014,01,574.600000,29.606338,604.206338,544.993662,604.206338,571.190399,1.157232,1.057802
2,A00,PRODUCT34,201402,679.0,679.0,2014,02,564.833333,40.893287,605.726620,523.940046,605.726620,561.991999,1.208202,1.077821
3,A00,PRODUCT34,201403,578.0,578.0,2014,03,551.285714,48.944649,600.230364,502.341065,578.000000,548.850285,1.053111,1.053111
4,A00,PRODUCT34,201406,423.0,423.0,2014,06,533.428571,51.644551,585.073123,481.784020,481.784020,523.245283,0.808416,0.920761

In [ ]:

# DB 테이블을 읽어 Data Frame 변수에 저장하기
#sqlData = pd.read_sql_query('SELECT * FROM kopo_channel_seasonality_new', engine1)